const { beforeEach } = require("node:test")


describe('Управление тарифами', () => {
    beforeEach( () => {
        cy.loginApi()
        cy.changeCompanyApi('ООО ПСТ')
    })
    context('Приветственный тариф', () => {
        it('Основные параметры', () => {

        })
        it('Градусники', () => {

        })
        it('Смена на тариф Корпоративный', () => {

        })
        it('Смена на тариф Оптимальный', () => {

        })
    })
    context('Расчетный тариф', () => {
        it('', () => {

        })
    })
    context('Активный Вэд тариф', () => {
        it('', () => {

        })
    })
    context('Комплексный тариф', () => {
        it('', () => {

        })
    })
    context('Специальный тариф', () => {
        it('', () => {

        })
    })
    context('Стартовый тариф', () => {
        it('', () => {

        })
    })
    context('Оптимальный тариф', () => {
        it('', () => {

        })
    })
    context('Корпоративный тариф', () => {
        it('', () => {

        })
    })

})